function addLang(data) {
    return Object.assign(g_lang, data)
}

var g_lang = {
    "确定删除吗": {
        "zh": "确定删除吗?",
        "jp": "削除してもいいですか？",
        "en": ""
    },
    "输入评论": {
        "zh": "输入评论...",
        "jp": "コメントを書く...",
        "en": ""
    },
    "上传": {
        "zh": "上传",
        "jp": "アップロードする",
        "en": ""
    },
    "删除": {
        "zh": "删除",
        "jp": "削除",
        "en": ""
    },
    "加载中": {
        "zh": "加载中...",
        "jp": "読み込み中",
        "en": ""
    },

    确定: {
        zh: "",
        jp: "確認",
        en: ""
    },

    删除: {
        zh: "删除",
        jp: "削除",
        en: ""
    },
    保存: {
        zh: "",
        jp: "",
        en: ""
    },
    选择操作: {
        zh: "",
        jp: "操作",
        en: ""
    },
    对象不存在: {
        zh: "",
        jp: "対象は存在していません",
        en: ""
    },
    发生错误: {
        zh: "",
        jp: "エラーが発生しました",
        en: ""
    },
    取消: {
        zh: "",
        jp: "キャンセル",
        en: ""
    },
     开始自动播放: {
        zh: "",
        jp: "再生が始まりました",
        en: ""
    },
    踢出: {
        zh: "",
        jp: "",
        en: ""
    },
    玩家列表: {
        zh: "",
        jp: "プレイヤーリスト",
        en: ""
    },
    分享: {
        zh: "",
        jp: "シェア",
        en: ""
    },
    分享了歌曲: {
        zh: "%0",
        jp: "%0",
        en: "%0"
    },
    复制成功: {
        zh: "",
        jp: "コピーしました",
        en: ""
    },
    复制: {
        zh: "",
        jp: "コピー",
        en: ""
    },
    请先上传: {
        zh: "",
        jp: "まずは画像をアップロードしてください",
        en: ""
    },
    确定吗: {
        zh: "",
        jp: "よろしいでしょうか？",
        en: ""
    },
    再来一次: {
        zh: "",
        jp: "もう一回",
        en: ""
    },
    投票: {
        zh: "",
        jp: "",
        en: ""
    },
    随机: {
        zh: "",
        jp: "ランダム",
        en: ""
    },
    自由: {
        zh: "",
        jp: "",
        en: ""
    },
    选择计时方式: {
        zh: "",
        jp: "モード",
        en: ""
    },
    字数过长: {
        zh: "",
        jp: "長いかも",
        en: ""
    },
    新建房间名: {
        zh: "%0的房间",
        jp: "%0の部屋",
        en: ""
    },
    房间设置: {
        zh: "",
        jp: "ルーム設定",
        en: ""
    },
    房间名字: {
        zh: "",
        jp: "タイトル",
        en: ""
    },
    房间名字_占位符: {
        zh: "",
        jp: "名前を入力",
        en: ""
    },
    房间标签_占位符: {
        zh: "用逗号分开,最多5个标签",
        jp: "eg: a,b,c",
        en: ""
    },
    最大人数: {
        zh: "",
        jp: "",
        en: ""
    },
    四位密码_占位符: {
        zh: "不填不设置",
        jp: "　",
        en: ""
    },
    最大人数_占位符: {
        zh: "0=不限制",
        jp: "　",
        en: ""
    },
    房间介绍: {
        zh: "",
        jp: "紹介",
        en: ""
    },
    房间介绍_占位符: {
        zh: "",
        jp: "一言を入力",
        en: ""
    },
    背景图片: {
        zh: "",
        jp: "背景画像",
        en: ""
    },
    背景图片_自定义: {
        zh: "自定义",
        jp: "カスタム",
        en: ""
    },
    新建: {
        zh: "",
        jp: "新規",
        en: ""
    },
    已收集: {
        zh: "",
        jp: "集め込み",
        en: ""
    },
    密码不填或者需要四位数: {
        zh: "",
        jp: "",
        en: ""
    },
    输入密码_标题: {
        zh: "",
        jp: "パスワード",
        en: ""
    },
    请选择: {
        zh: "",
        jp: "選択してください",
        en: ""
    },
    提示: {
        zh: "",
        jp: "ヒント",
        en: ""
    },
    请输入: {
        zh: "",
        jp: "入力してください",
        en: ""
    },
    参考图: {
        zh: "",
        jp: "",
        en: ""
    },
    照片: {
        zh: "",
        jp: "写真",
        en: ""
    },
    游戏: {
        zh: "",
        jp: "ゲーム",
        en: ""
    },
    输入消息: {
        zh: "",
        jp: "メッセージを入力",
        en: ""
    },
    自由模式开始: {
        zh: "",
        jp: "自由に書いて下さい",
        en: ""
    },
    收集: {
        zh: "",
        jp: "集める",
        en: ""
    },
    加入: {
        zh: "",
        jp: "参加",
        en: ""
    },
    点击重试: {
        zh: "",
        jp: "再読み込み",
        en: ""
    },
    刷新: {
        zh: "",
        jp: "再読み込み",
        en: ""
    },
    什么都没有: {
        zh: "上图上图...",
        jp: "まだ何もありません",
        en: ""
    },
    是否退出房间: {
        zh: "确定退出房间吗?你已经待了 %0 了!",
        jp: "退室しますか？ %0 が経ちました",
        en: ""
    },
     房间满人: {
        zh: "",
        jp: "メンバーがいっぱいになりました。",
        en: ""
    },
    是否关闭房间: {
        zh: "",
        jp: "部屋をしめるですか？",
        en: ""
    },
    房主: {
        zh: "",
        jp: "オーナー",
        en: ""
    },
    到底啦: {
        zh: "",
        jp: "この下何もない",
        en: ""
    },
    成功删除: {
        zh: "",
        jp: "削除しました",
        en: ""
    },
    你被禁止加入: {
        zh: "你被房主禁止加入该房间",
        jp: "この行為禁止されています",
        en: ""
    },
    成功踢除: {
        zh: "成功踢除 %0",
        jp: "%0　の参加を禁止しました",
        en: ""
    },
    对象不能是自己: {
        zh: "",
        jp: "自分以外のターゲットを選択してください",
        en: ""
    },
    你被房主请出了房间: {
        zh: "",
        jp: "オーナーがあなたの入室を禁止しました",
        en: ""
    },
    成功修改: {
        zh: "",
        jp: "設定が更新しました",
        en: ""
    },
    成功创建房间: {
        zh: "成功创建房间 :  %0",
        jp: "作成成功！",
        en: ""
    },
    是否关闭旧房间: {
        zh: "开启新房间将会关闭房间 %0,你确定吗?",
        jp: "新しい部屋を開くと、古い部屋 %0 が閉じられますが、よろしいですか？",
        en: ""
    },
    上传中: {
        zh: "",
        jp: "アップロード中",
        en: ""
    },
    计时完毕: {
        zh: "",
        jp: "時間切",
        en: ""
    },
    无结果: {
        zh: "",
        jp: "参加者いません",
        en: ""
    },
    投票结果: {
        zh: "",
        jp: "",
        en: ""
    },

    开始: {
        zh: "",
        jp: "始め",
        en: ""
    },

    开始投票: {
        zh: "开始投票！点击红心选择心仪的图像",
        jp: "投票してください",
        en: ""
    },
    START: {
        zh: "",
        jp: "",
        en: ""
    },
    加入了房间: {
        zh: "%0 加入了房间",
        jp: "%0　さんが入室しました",
        en: ""
    },
    更换了头像: {
        zh: "%0 更换了头像",
        jp: "%0 さんのアイコン変更されました",
        en: ""
    },
    退出了房间: {
        zh: "%0 退出了房间",
        jp: "%0 さんが退室しました",
        en: ""
    },
    房间已关闭: {
        zh: "房间 %0 已关闭",
        jp: "部屋 %0 が閉めました",
        en: ""
    },
    房主的账号受到特殊保护: {
        zh: "",
        jp: "ホームオーナーのアカウントは特別な保護下にあります",
        en: ""
    },
    名称已被使用: {
        zh: "名称 %0 已被使用",
        jp: "名前　%0 は既に使用されています",
        en: ""
    },
    图片已被上传: {
        zh: "%0 张图片已经被上传过了",
        jp: "%0 枚写真は既にアップロードされました",
        en: ""
    },
    r15_标题: {
        zh: "限制级-R15",
        jp: "限制级-R15",
        en: ""
    },
    r15_介绍: {
        zh: "限制级（R-15）：未满15岁禁止入场",
        jp: "15歳未満の方の入場はご遠慮ください",
        en: ""
    },
    r18_标题: {
        zh: "成人级-R18",
        jp: "成人级-R18",
        en: ""
    },
    r18_介绍: {
        zh: "未满18岁禁止入场。",
        jp: "18歳未満の方の入場はご遠慮ください",
        en: ""
    },
    默认房间_标题: {
        zh: "默认房间",
        jp: "初心者の村",
        en: ""
    },
    默认房间_介绍: {
        zh: "欢迎欢迎",
        jp: "誰でも大歓迎",
        en: ""
    },
    年龄验证: {
        zh: "你满18岁吗?",
        jp: "あなたは18歳ですか？",
        en: ""
    }
}

function _l(k) {
    var lang = g_config.lang || 'zh';
    if (g_lang[k] && g_lang[k][lang]) {
        k = g_lang[k][lang];
    }
    var args = Array.from(arguments);
    args.shift(); // 去除第一个 k
    var len = args.length;
    if (len) {
        args = len == 1 && Array.isArray(args[0]) ? args[0] : args; // 如果是数组则用数组
        for (var i = 0; i < args.length; i++) {
            k = k.replace('%' + i, args[i]);
        }
        return k;
    }
    return k;
}